### ACQUIRE:
- Goal: leave this section with a dataframe ready to prepare.

- The ad hoc part includes **summarizing your data** as you read it in and begin to explore, look at the **first few rows, data types, summary stats, column names, shape of the data frame, etc**.

- `acquire.py`: The reproducible part is the gathering data from SQL.

In [1]:
import pandas as pd
from env import url
import os.path

In [2]:
#Read from Zillow database and write df to a csv
def get_data():
    query = '''
        SELECT calculatedfinishedsquarefeet as home_size, 
        bedroomcnt, bathroomcnt, 
        (taxamount / taxvaluedollarcnt) as tax_rate,
        yearbuilt, taxvaluedollarcnt as home_value
        FROM properties_2017 
        JOIN predictions_2017 USING(id)
        WHERE transactiondate >= '2017-05-01' 
            AND transactiondate <= '2017-06-30'
            AND propertylandusetypeid = 261
    '''
    df = pd.read_sql_query(query, url("zillow"))
    df.to_csv('zillow.csv')
    return df

In [3]:
if os.path.exists('zillow.csv'):
    df = pd.read_csv('zillow.csv',  index_col=0)
else:
    df = get_data()

In [4]:
df.head()

   home_size  bedroomcnt  bathroomcnt  tax_rate  yearbuilt  home_value
0     1604.0         4.0          2.0  0.012220     1950.0    498347.0
1     2384.0         3.0          3.0  0.012146     1937.0    549917.0
2     1574.0         3.0          2.0  0.016476     1990.0    235272.0
3     1619.0         2.0          2.0  0.012371     1983.0    340000.0
4     2408.0         2.0          3.0  0.012073     1952.0   2017254.0

**Reading data from csv**

In [5]:
df.shape

(16075, 6)

In [6]:
df.dtypes

home_size      float64
bedroomcnt     float64
bathroomcnt    float64
tax_rate       float64
yearbuilt      float64
home_value     float64
dtype: object

In [7]:
df.describe()

,home_size,bedroomcnt,bathroomcnt,tax_rate,yearbuilt,home_value
count,16035.000000,16075.000000,16075.000000,16037.000000,16029.000000,1.607200e+04
mean,1834.159464,3.234961,2.202799,0.013353,1958.086094,4.641904e+05
std,988.938585,0.977142,1.036937,0.003783,22.133845,6.537579e+05
min,60.000000,0.000000,0.000000,0.000032,1862.000000,1.900000e+01
25%,1231.000000,3.000000,2.000000,0.011917,1947.000000,1.803710e+05
50%,1590.000000,3.000000,2.000000,0.012461,1955.000000,3.186695e+05
75%,2160.000000,4.000000,3.000000,0.013695,1971.000000,5.281412e+05
max,26345.000000,25.000000,20.000000,0.155072,2015.000000,1.912982e+07

In [8]:
df.isnull().sum()

home_size      40
bedroomcnt      0
bathroomcnt     0
tax_rate       38
yearbuilt      46
home_value      3
dtype: int64

In [9]:
df[df.home_size.isnull()].head()

      home_size  bedroomcnt  bathroomcnt  tax_rate  yearbuilt  home_value
5           NaN         0.0          0.0  0.014476        NaN   5240710.0
1299        NaN         0.0          0.0       NaN     1990.0        19.0
2081        NaN         0.0          0.0  0.011958        NaN   9710604.0
2159        NaN         0.0          0.0  0.011948        NaN   2274642.0
3809        NaN         0.0          0.0       NaN        NaN      9345.0

In [10]:
df[df.home_value.isnull()].head()

       home_size  bedroomcnt  bathroomcnt  tax_rate  yearbuilt  home_value
3985       807.0         3.0          1.0       NaN     1924.0         NaN
9643         NaN         0.0          0.0       NaN        NaN         NaN
10047     1650.0         2.0          2.0       NaN     1987.0         NaN

In [11]:
df[df.tax_rate.isnull()].head()

      home_size  bedroomcnt  bathroomcnt  tax_rate  yearbuilt  home_value
455       796.0         1.0          1.0       NaN     1920.0     77615.0
1299        NaN         0.0          0.0       NaN     1990.0        19.0
1355     1186.0         3.0          2.0       NaN     1955.0     19482.0
1546      881.0         0.0          0.0       NaN     1928.0    121159.0
1688      868.0         2.0          1.0       NaN     1949.0     36964.0